espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_itm.h
/******************************************************************************
*  Filename:       hw_cpu_itm_h
*  Revised:        $Date$
*  Revision:       $Revision$
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_CPU_ITM_H__
#define __HW_CPU_ITM_H__

//*****************************************************************************
//
// This section defines the register offsets of
// CPU_ITM component
//
//*****************************************************************************
// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM0                                             0x00000000

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM1                                             0x00000004

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM2                                             0x00000008

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM3                                             0x0000000C

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM4                                             0x00000010

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM5                                             0x00000014

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM6                                             0x00000018

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM7                                             0x0000001C

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM8                                             0x00000020

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM9                                             0x00000024

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM10                                            0x00000028

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM11                                            0x0000002C

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM12                                            0x00000030

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM13                                            0x00000034

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM14                                            0x00000038

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM15                                            0x0000003C

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM16                                            0x00000040

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM17                                            0x00000044

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM18                                            0x00000048

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM19                                            0x0000004C

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM20                                            0x00000050

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM21                                            0x00000054

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM22                                            0x00000058

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM23                                            0x0000005C

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM24                                            0x00000060

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM25                                            0x00000064

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM26                                            0x00000068

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM27                                            0x0000006C

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM28                                            0x00000070

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM29                                            0x00000074

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM30                                            0x00000078

// Provides the interface for generating Instrumentation packets
#define CPU_ITM_O_STIM31                                            0x0000007C

// Provide an individual enable bit for each ITM_STIM register
#define CPU_ITM_O_TER0                                              0x00000E00

