espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_itm.h
// Controls which stimulus ports can be accessed by unprivileged code
#define CPU_ITM_O_TPR                                               0x00000E40

// Configures and controls transfers through the ITM interface
#define CPU_ITM_O_TCR                                               0x00000E80

// Integration Mode: Read ATB Ready
#define CPU_ITM_O_INT_ATREADY                                       0x00000EF0

// Integration Mode: Write ATB Valid
#define CPU_ITM_O_INT_ATVALID                                       0x00000EF8

// Integration Mode Control Register
#define CPU_ITM_O_ITCTRL                                            0x00000F00

// Provides CoreSight discovery information for the ITM
#define CPU_ITM_O_DEVARCH                                           0x00000FBC

// Provides CoreSight discovery information for the ITM
#define CPU_ITM_O_DEVTYPE                                           0x00000FCC

// Provides CoreSight discovery information for the ITM
#define CPU_ITM_O_PIDR4                                             0x00000FD0

// Provides CoreSight discovery information for the ITM
#define CPU_ITM_O_PIDR5                                             0x00000FD4

// Provides CoreSight discovery information for the ITM
#define CPU_ITM_O_PIDR6                                             0x00000FD8

// Provides CoreSight discovery information for the ITM
#define CPU_ITM_O_PIDR7                                             0x00000FDC

// Provides CoreSight discovery information for the ITM
#define CPU_ITM_O_PIDR0                                             0x00000FE0

// Provides CoreSight discovery information for the ITM
#define CPU_ITM_O_PIDR1                                             0x00000FE4

// Provides CoreSight discovery information for the ITM
#define CPU_ITM_O_PIDR2                                             0x00000FE8

// Provides CoreSight discovery information for the ITM
#define CPU_ITM_O_PIDR3                                             0x00000FEC

// Provides CoreSight discovery information for the ITM
#define CPU_ITM_O_CIDR0                                             0x00000FF0

// Provides CoreSight discovery information for the ITM
#define CPU_ITM_O_CIDR1                                             0x00000FF4

// Provides CoreSight discovery information for the ITM
#define CPU_ITM_O_CIDR2                                             0x00000FF8

// Provides CoreSight discovery information for the ITM
#define CPU_ITM_O_CIDR3                                             0x00000FFC

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM0
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM0_DISABLED                                      0x00000002
#define CPU_ITM_STIM0_DISABLED_BITN                                          1
#define CPU_ITM_STIM0_DISABLED_M                                    0x00000002
#define CPU_ITM_STIM0_DISABLED_S                                             1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM0_FIFOREADY                                     0x00000001
#define CPU_ITM_STIM0_FIFOREADY_BITN                                         0
#define CPU_ITM_STIM0_FIFOREADY_M                                   0x00000001
#define CPU_ITM_STIM0_FIFOREADY_S                                            0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM1
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM1_DISABLED                                      0x00000002
#define CPU_ITM_STIM1_DISABLED_BITN                                          1
#define CPU_ITM_STIM1_DISABLED_M                                    0x00000002
#define CPU_ITM_STIM1_DISABLED_S                                             1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM1_FIFOREADY                                     0x00000001
#define CPU_ITM_STIM1_FIFOREADY_BITN                                         0
#define CPU_ITM_STIM1_FIFOREADY_M                                   0x00000001
#define CPU_ITM_STIM1_FIFOREADY_S                                            0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM2
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM2_DISABLED                                      0x00000002
#define CPU_ITM_STIM2_DISABLED_BITN                                          1
#define CPU_ITM_STIM2_DISABLED_M                                    0x00000002
#define CPU_ITM_STIM2_DISABLED_S                                             1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM2_FIFOREADY                                     0x00000001
#define CPU_ITM_STIM2_FIFOREADY_BITN                                         0
#define CPU_ITM_STIM2_FIFOREADY_M                                   0x00000001
#define CPU_ITM_STIM2_FIFOREADY_S                                            0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM3
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM3_DISABLED                                      0x00000002
#define CPU_ITM_STIM3_DISABLED_BITN                                          1
#define CPU_ITM_STIM3_DISABLED_M                                    0x00000002
#define CPU_ITM_STIM3_DISABLED_S                                             1

