espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_itm.h
// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM3_FIFOREADY                                     0x00000001
#define CPU_ITM_STIM3_FIFOREADY_BITN                                         0
#define CPU_ITM_STIM3_FIFOREADY_M                                   0x00000001
#define CPU_ITM_STIM3_FIFOREADY_S                                            0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM4
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM4_DISABLED                                      0x00000002
#define CPU_ITM_STIM4_DISABLED_BITN                                          1
#define CPU_ITM_STIM4_DISABLED_M                                    0x00000002
#define CPU_ITM_STIM4_DISABLED_S                                             1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM4_FIFOREADY                                     0x00000001
#define CPU_ITM_STIM4_FIFOREADY_BITN                                         0
#define CPU_ITM_STIM4_FIFOREADY_M                                   0x00000001
#define CPU_ITM_STIM4_FIFOREADY_S                                            0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM5
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM5_DISABLED                                      0x00000002
#define CPU_ITM_STIM5_DISABLED_BITN                                          1
#define CPU_ITM_STIM5_DISABLED_M                                    0x00000002
#define CPU_ITM_STIM5_DISABLED_S                                             1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM5_FIFOREADY                                     0x00000001
#define CPU_ITM_STIM5_FIFOREADY_BITN                                         0
#define CPU_ITM_STIM5_FIFOREADY_M                                   0x00000001
#define CPU_ITM_STIM5_FIFOREADY_S                                            0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM6
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM6_DISABLED                                      0x00000002
#define CPU_ITM_STIM6_DISABLED_BITN                                          1
#define CPU_ITM_STIM6_DISABLED_M                                    0x00000002
#define CPU_ITM_STIM6_DISABLED_S                                             1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM6_FIFOREADY                                     0x00000001
#define CPU_ITM_STIM6_FIFOREADY_BITN                                         0
#define CPU_ITM_STIM6_FIFOREADY_M                                   0x00000001
#define CPU_ITM_STIM6_FIFOREADY_S                                            0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM7
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM7_DISABLED                                      0x00000002
#define CPU_ITM_STIM7_DISABLED_BITN                                          1
#define CPU_ITM_STIM7_DISABLED_M                                    0x00000002
#define CPU_ITM_STIM7_DISABLED_S                                             1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM7_FIFOREADY                                     0x00000001
#define CPU_ITM_STIM7_FIFOREADY_BITN                                         0
#define CPU_ITM_STIM7_FIFOREADY_M                                   0x00000001
#define CPU_ITM_STIM7_FIFOREADY_S                                            0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM8
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM8_DISABLED                                      0x00000002
#define CPU_ITM_STIM8_DISABLED_BITN                                          1
#define CPU_ITM_STIM8_DISABLED_M                                    0x00000002
#define CPU_ITM_STIM8_DISABLED_S                                             1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM8_FIFOREADY                                     0x00000001
#define CPU_ITM_STIM8_FIFOREADY_BITN                                         0
#define CPU_ITM_STIM8_FIFOREADY_M                                   0x00000001
#define CPU_ITM_STIM8_FIFOREADY_S                                            0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM9
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM9_DISABLED                                      0x00000002
#define CPU_ITM_STIM9_DISABLED_BITN                                          1
#define CPU_ITM_STIM9_DISABLED_M                                    0x00000002
#define CPU_ITM_STIM9_DISABLED_S                                             1

