espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_itm.h
// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM9_FIFOREADY                                     0x00000001
#define CPU_ITM_STIM9_FIFOREADY_BITN                                         0
#define CPU_ITM_STIM9_FIFOREADY_M                                   0x00000001
#define CPU_ITM_STIM9_FIFOREADY_S                                            0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM10
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM10_DISABLED                                     0x00000002
#define CPU_ITM_STIM10_DISABLED_BITN                                         1
#define CPU_ITM_STIM10_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM10_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM10_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM10_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM10_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM10_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM11
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM11_DISABLED                                     0x00000002
#define CPU_ITM_STIM11_DISABLED_BITN                                         1
#define CPU_ITM_STIM11_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM11_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM11_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM11_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM11_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM11_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM12
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM12_DISABLED                                     0x00000002
#define CPU_ITM_STIM12_DISABLED_BITN                                         1
#define CPU_ITM_STIM12_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM12_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM12_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM12_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM12_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM12_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM13
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM13_DISABLED                                     0x00000002
#define CPU_ITM_STIM13_DISABLED_BITN                                         1
#define CPU_ITM_STIM13_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM13_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM13_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM13_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM13_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM13_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM14
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM14_DISABLED                                     0x00000002
#define CPU_ITM_STIM14_DISABLED_BITN                                         1
#define CPU_ITM_STIM14_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM14_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM14_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM14_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM14_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM14_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM15
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM15_DISABLED                                     0x00000002
#define CPU_ITM_STIM15_DISABLED_BITN                                         1
#define CPU_ITM_STIM15_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM15_DISABLED_S                                            1

