espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_itm.h
// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM15_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM15_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM15_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM15_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM16
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM16_DISABLED                                     0x00000002
#define CPU_ITM_STIM16_DISABLED_BITN                                         1
#define CPU_ITM_STIM16_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM16_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM16_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM16_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM16_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM16_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM17
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM17_DISABLED                                     0x00000002
#define CPU_ITM_STIM17_DISABLED_BITN                                         1
#define CPU_ITM_STIM17_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM17_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM17_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM17_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM17_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM17_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM18
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM18_DISABLED                                     0x00000002
#define CPU_ITM_STIM18_DISABLED_BITN                                         1
#define CPU_ITM_STIM18_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM18_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM18_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM18_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM18_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM18_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM19
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM19_DISABLED                                     0x00000002
#define CPU_ITM_STIM19_DISABLED_BITN                                         1
#define CPU_ITM_STIM19_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM19_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM19_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM19_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM19_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM19_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM20
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM20_DISABLED                                     0x00000002
#define CPU_ITM_STIM20_DISABLED_BITN                                         1
#define CPU_ITM_STIM20_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM20_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM20_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM20_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM20_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM20_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM21
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM21_DISABLED                                     0x00000002
#define CPU_ITM_STIM21_DISABLED_BITN                                         1
#define CPU_ITM_STIM21_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM21_DISABLED_S                                            1

