espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_itm.h
// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM21_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM21_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM21_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM21_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM22
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM22_DISABLED                                     0x00000002
#define CPU_ITM_STIM22_DISABLED_BITN                                         1
#define CPU_ITM_STIM22_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM22_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM22_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM22_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM22_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM22_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM23
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM23_DISABLED                                     0x00000002
#define CPU_ITM_STIM23_DISABLED_BITN                                         1
#define CPU_ITM_STIM23_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM23_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM23_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM23_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM23_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM23_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM24
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM24_DISABLED                                     0x00000002
#define CPU_ITM_STIM24_DISABLED_BITN                                         1
#define CPU_ITM_STIM24_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM24_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM24_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM24_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM24_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM24_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM25
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM25_DISABLED                                     0x00000002
#define CPU_ITM_STIM25_DISABLED_BITN                                         1
#define CPU_ITM_STIM25_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM25_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM25_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM25_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM25_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM25_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM26
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM26_DISABLED                                     0x00000002
#define CPU_ITM_STIM26_DISABLED_BITN                                         1
#define CPU_ITM_STIM26_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM26_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM26_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM26_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM26_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM26_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM27
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM27_DISABLED                                     0x00000002
#define CPU_ITM_STIM27_DISABLED_BITN                                         1
#define CPU_ITM_STIM27_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM27_DISABLED_S                                            1

