espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_itm.h
// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM27_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM27_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM27_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM27_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM28
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM28_DISABLED                                     0x00000002
#define CPU_ITM_STIM28_DISABLED_BITN                                         1
#define CPU_ITM_STIM28_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM28_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM28_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM28_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM28_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM28_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM29
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM29_DISABLED                                     0x00000002
#define CPU_ITM_STIM29_DISABLED_BITN                                         1
#define CPU_ITM_STIM29_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM29_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM29_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM29_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM29_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM29_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM30
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM30_DISABLED                                     0x00000002
#define CPU_ITM_STIM30_DISABLED_BITN                                         1
#define CPU_ITM_STIM30_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM30_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM30_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM30_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM30_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM30_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM31
//
//*****************************************************************************
// Field:     [1] DISABLED
//
// Indicates whether the Stimulus Port is enabled or disabled
#define CPU_ITM_STIM31_DISABLED                                     0x00000002
#define CPU_ITM_STIM31_DISABLED_BITN                                         1
#define CPU_ITM_STIM31_DISABLED_M                                   0x00000002
#define CPU_ITM_STIM31_DISABLED_S                                            1

// Field:     [0] FIFOREADY
//
// Indicates whether the Stimulus Port can accept data
#define CPU_ITM_STIM31_FIFOREADY                                    0x00000001
#define CPU_ITM_STIM31_FIFOREADY_BITN                                        0
#define CPU_ITM_STIM31_FIFOREADY_M                                  0x00000001
#define CPU_ITM_STIM31_FIFOREADY_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_TER0
//
//*****************************************************************************
// Field:  [31:0] STIMENA
//
// For STIMENA[m] in ITM_TER*n, controls whether ITM_STIM(32*n + m) is enabled
#define CPU_ITM_TER0_STIMENA_W                                              32
#define CPU_ITM_TER0_STIMENA_M                                      0xFFFFFFFF
#define CPU_ITM_TER0_STIMENA_S                                               0

//*****************************************************************************
//
// Register: CPU_ITM_O_TPR
//
//*****************************************************************************
// Field:  [31:0] PRIVMASK
//
// For PRIVMASK[m], defines the access permissions of ITM_STIM Stimulus Ports
// 8m to 8m+7 inclusive
#define CPU_ITM_TPR_PRIVMASK_W                                              32
#define CPU_ITM_TPR_PRIVMASK_M                                      0xFFFFFFFF
#define CPU_ITM_TPR_PRIVMASK_S                                               0

//*****************************************************************************
//
// Register: CPU_ITM_O_TCR
//
//*****************************************************************************
// Field:    [23] BUSY
//
// Indicates whether the ITM is currently processing events
#define CPU_ITM_TCR_BUSY                                            0x00800000
#define CPU_ITM_TCR_BUSY_BITN                                               23
#define CPU_ITM_TCR_BUSY_M                                          0x00800000
#define CPU_ITM_TCR_BUSY_S                                                  23

// Field: [22:16] TraceBusID
//
// Identifier for multi-source trace stream formatting. If multi-source trace
// is in use, the debugger must write a unique non-zero trace ID value to this
// field
#define CPU_ITM_TCR_TRACEBUSID_W                                             7
#define CPU_ITM_TCR_TRACEBUSID_M                                    0x007F0000
#define CPU_ITM_TCR_TRACEBUSID_S                                            16

// Field: [11:10] GTSFREQ
//
// Defines how often the ITM generates a global timestamp, based on the global
// timestamp clock frequency, or disables generation of global timestamps
#define CPU_ITM_TCR_GTSFREQ_W                                                2
#define CPU_ITM_TCR_GTSFREQ_M                                       0x00000C00
#define CPU_ITM_TCR_GTSFREQ_S                                               10

// Field:   [9:8] TSPrescale
//
// Local timestamp prescaler, used with the trace packet reference clock
#define CPU_ITM_TCR_TSPRESCALE_W                                             2
#define CPU_ITM_TCR_TSPRESCALE_M                                    0x00000300
#define CPU_ITM_TCR_TSPRESCALE_S                                             8

// Field:     [5] STALLENA
//
// Stall the PE to guarantee delivery of Data Trace packets.
#define CPU_ITM_TCR_STALLENA                                        0x00000020
#define CPU_ITM_TCR_STALLENA_BITN                                            5
#define CPU_ITM_TCR_STALLENA_M                                      0x00000020
#define CPU_ITM_TCR_STALLENA_S                                               5

// Field:     [4] SWOENA
//
// Enables asynchronous clocking of the timestamp counter
#define CPU_ITM_TCR_SWOENA                                          0x00000010
#define CPU_ITM_TCR_SWOENA_BITN                                              4
#define CPU_ITM_TCR_SWOENA_M                                        0x00000010
#define CPU_ITM_TCR_SWOENA_S                                                 4

