espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_itm.h
// Field:     [3] TXENA
//
// Enables forwarding of hardware event packet from the DWT unit to the ITM for
// output to the TPIU
#define CPU_ITM_TCR_TXENA                                           0x00000008
#define CPU_ITM_TCR_TXENA_BITN                                               3
#define CPU_ITM_TCR_TXENA_M                                         0x00000008
#define CPU_ITM_TCR_TXENA_S                                                  3

// Field:     [2] SYNCENA
//
// Enables Synchronization packet transmission for a synchronous TPIU
#define CPU_ITM_TCR_SYNCENA                                         0x00000004
#define CPU_ITM_TCR_SYNCENA_BITN                                             2
#define CPU_ITM_TCR_SYNCENA_M                                       0x00000004
#define CPU_ITM_TCR_SYNCENA_S                                                2

// Field:     [1] TSENA
//
// Enables Local timestamp generation
#define CPU_ITM_TCR_TSENA                                           0x00000002
#define CPU_ITM_TCR_TSENA_BITN                                               1
#define CPU_ITM_TCR_TSENA_M                                         0x00000002
#define CPU_ITM_TCR_TSENA_S                                                  1

// Field:     [0] ITMENA
//
// Enables the ITM
#define CPU_ITM_TCR_ITMENA                                          0x00000001
#define CPU_ITM_TCR_ITMENA_BITN                                              0
#define CPU_ITM_TCR_ITMENA_M                                        0x00000001
#define CPU_ITM_TCR_ITMENA_S                                                 0

//*****************************************************************************
//
// Register: CPU_ITM_O_INT_ATREADY
//
//*****************************************************************************
// Field:     [1] AFVALID
//
// A read of this bit returns the value of AFVALID
#define CPU_ITM_INT_ATREADY_AFVALID                                 0x00000002
#define CPU_ITM_INT_ATREADY_AFVALID_BITN                                     1
#define CPU_ITM_INT_ATREADY_AFVALID_M                               0x00000002
#define CPU_ITM_INT_ATREADY_AFVALID_S                                        1

// Field:     [0] ATREADY
//
// A read of this bit returns the value of ATREADY
#define CPU_ITM_INT_ATREADY_ATREADY                                 0x00000001
#define CPU_ITM_INT_ATREADY_ATREADY_BITN                                     0
#define CPU_ITM_INT_ATREADY_ATREADY_M                               0x00000001
#define CPU_ITM_INT_ATREADY_ATREADY_S                                        0

//*****************************************************************************
//
// Register: CPU_ITM_O_INT_ATVALID
//
//*****************************************************************************
// Field:     [1] AFREADY
//
// A write to this bit gives the value of AFREADY
#define CPU_ITM_INT_ATVALID_AFREADY                                 0x00000002
#define CPU_ITM_INT_ATVALID_AFREADY_BITN                                     1
#define CPU_ITM_INT_ATVALID_AFREADY_M                               0x00000002
#define CPU_ITM_INT_ATVALID_AFREADY_S                                        1

// Field:     [0] ATREADY
//
// A write to this bit gives the value of ATVALID
#define CPU_ITM_INT_ATVALID_ATREADY                                 0x00000001
#define CPU_ITM_INT_ATVALID_ATREADY_BITN                                     0
#define CPU_ITM_INT_ATVALID_ATREADY_M                               0x00000001
#define CPU_ITM_INT_ATVALID_ATREADY_S                                        0

//*****************************************************************************
//
// Register: CPU_ITM_O_ITCTRL
//
//*****************************************************************************
// Field:     [0] IME
//
// Integration mode enable bit - The possible values are:  0 - The trace unit
// is not in integration mode. 1 - The trace unit is in integration mode. This
// mode enables: A debug agent to perform topology detection. SoC test software
// to perform integration testing.
#define CPU_ITM_ITCTRL_IME                                          0x00000001
#define CPU_ITM_ITCTRL_IME_BITN                                              0
#define CPU_ITM_ITCTRL_IME_M                                        0x00000001
#define CPU_ITM_ITCTRL_IME_S                                                 0

//*****************************************************************************
//
// Register: CPU_ITM_O_DEVARCH
//
//*****************************************************************************
// Field: [31:21] ARCHITECT
//
// Defines the architect of the component. Bits [31:28] are the JEP106
// continuation code (JEP106 bank ID, minus 1) and bits [27:21] are the JEP106
// ID code.
#define CPU_ITM_DEVARCH_ARCHITECT_W                                         11
#define CPU_ITM_DEVARCH_ARCHITECT_M                                 0xFFE00000
#define CPU_ITM_DEVARCH_ARCHITECT_S                                         21

// Field:    [20] PRESENT
//
// Defines that the DEVARCH register is present
#define CPU_ITM_DEVARCH_PRESENT                                     0x00100000
#define CPU_ITM_DEVARCH_PRESENT_BITN                                        20
#define CPU_ITM_DEVARCH_PRESENT_M                                   0x00100000
#define CPU_ITM_DEVARCH_PRESENT_S                                           20

// Field: [19:16] REVISION
//
// Defines the architecture revision of the component
#define CPU_ITM_DEVARCH_REVISION_W                                           4
#define CPU_ITM_DEVARCH_REVISION_M                                  0x000F0000
#define CPU_ITM_DEVARCH_REVISION_S                                          16

// Field: [15:12] ARCHVER
//
// Defines the architecture version of the component
#define CPU_ITM_DEVARCH_ARCHVER_W                                            4
#define CPU_ITM_DEVARCH_ARCHVER_M                                   0x0000F000
#define CPU_ITM_DEVARCH_ARCHVER_S                                           12

// Field:  [11:0] ARCHPART
//
// Defines the architecture of the component
#define CPU_ITM_DEVARCH_ARCHPART_W                                          12
#define CPU_ITM_DEVARCH_ARCHPART_M                                  0x00000FFF
#define CPU_ITM_DEVARCH_ARCHPART_S                                           0

//*****************************************************************************
//
// Register: CPU_ITM_O_DEVTYPE
//
//*****************************************************************************
// Field:   [7:4] SUB
//
// Component sub-type
#define CPU_ITM_DEVTYPE_SUB_W                                                4
#define CPU_ITM_DEVTYPE_SUB_M                                       0x000000F0
#define CPU_ITM_DEVTYPE_SUB_S                                                4

